# Prácticas con SQL

Para executar as consultas SQL debes ter acceso a un servidor Mysql/MariaDB coa base de datos "universidade" cargada.

In [1]:
# Preparación do environment

# Instalación de librarías
# ipython-sql
# pymysql

# load the ipython-sql extension
%load_ext sql

In [ ]:
# Conexión á base de datos
# usuario: 'user'
# contrasinal: 'password'

In [ ]:
# Conexión desde Vagrant
user = 'user'
password = 'password'
connection_string = f'mysql+pymysql://{user}:{password}@192.168.33.150:3306/universidade'
%sql $connection_string

In [2]:
# Conexión a Openstack con túnel 
user = 'user'
password = 'password'
connection_string = f'mysql+pymysql://{user}:{password}@localhost:3306/universidade'
%sql $connection_string

'Connected: user@universidade'

In [2]:
# Conexión a OpenStack sen túnel (+VPN)
user = 'user'
password = 'password'
connection_string = f'mysql+pymysql://{user}:{password}@10.133.27.76:3306/universidade'
%sql $connection_string

'Connected: user@universidade'

## Esquema Database Universidade

![schema](esquema_db_universidade.png)

In [ ]:
# 1. Nomes e apelidos das persoas

In [3]:
%%sql
SELECT nome, apelido
FROM persoa;

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[('Luis', 'Ramírez'),
 ('Laura', 'Beltrán'),
 ('Pepe', 'Pérez'),
 ('Juan', 'Sánchez'),
 ('Luis', 'Jiménez'),
 ('Rosa', 'García'),
 ('Jorge', 'Sáenz'),
 ('María', 'Gutiérrez'),
 ('Rosario', 'Díaz'),
 ('Elena', 'González')]

In [4]:
# 2. Códigos, nome e créditos das materias.

In [5]:
%%sql
SELECT idMateria as codigo, nome, creditos
FROM materia;

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
5 rows affected.

[('115', 'Seguridad Vial', Decimal('4.50')),
 ('130113', 'Programación I', Decimal('9.00')),
 ('130122', 'Análisis II', Decimal('9.00')),
 ('150212', 'Química Física', Decimal('4.50')),
 ('160002', 'Contabilidad', Decimal('6.00'))]

In [6]:
# 3. Datos das persoas.

In [7]:
%sql SELECT * FROM persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[('16161616A', 'Luis', 'Ramírez', 'Haro', 'Pez', '34', '941111111', datetime.date(2069, 1, 1), '1'),
 ('17171717A', 'Laura', 'Beltrán', 'Madrid', 'Gran Vía', '23', '912121212', datetime.date(1974, 8, 8), '0'),
 ('18181818A', 'Pepe', 'Pérez', 'Madrid', 'Percebe', '13', '913131313', datetime.date(1980, 2, 2), '1'),
 ('19191919A', 'Juan', 'Sánchez', 'Bilbao', 'Melancolía', '7', '944141414', datetime.date(2066, 3, 3), '1'),
 ('20202020A', 'Luis', 'Jiménez', 'Nájera', 'Cigüeña', '15', '941151515', datetime.date(1979, 3, 3), '1'),
 ('21212121A', 'Rosa', 'García', 'Haro', 'Alegría', '16', '941161616', datetime.date(1978, 4, 4), '0'),
 ('23232323A', 'Jorge', 'Sáenz', 'Logroño', 'Luis Ulloa', '17', '941171717', datetime.date(1978, 9, 9), '1'),
 ('24242424A', 'María', 'Gutiérrez', 'Logroño', 'Avda. de la Paz', '18', '941181818', datetime.date(2064, 10, 10), '0'),
 ('25252525A', 'Rosario', 'Díaz', 'Logroño', 'Percebe', '19', '941191919', datetime.date(1971, 11, 11), '0'),
 ('26262626A', 'Elena', 'González', 'Logroño', 'Percebe', '20', '941202020', datetime.date(1975, 5, 5), '0')]

In [8]:
# 4. Posibilidades de créditos das asignaturas (usar DISTINCT).

In [9]:
%sql SELECT DISTINCT(creditos) FROM materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
3 rows affected.

[(Decimal('4.50'),), (Decimal('9.00'),), (Decimal('6.00'),)]

In [10]:
# 5. Custo das materias e o seu curso correspondente.

In [11]:
%sql SELECT curso, nome, custoBasico from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
5 rows affected.

[('', 'Seguridad Vial', Decimal('30.00')),
 ('1', 'Programación I', Decimal('60.00')),
 ('2', 'Análisis II', Decimal('60.00')),
 ('1', 'Química Física', Decimal('70.00')),
 ('1', 'Contabilidad', Decimal('70.00'))]

In [12]:
# 6. Suma do custo das materias.

In [13]:
%sql SELECT SUM(custoBasico) as "Total custo" from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(Decimal('290.00'),)]

In [14]:
# 7. Cantas asignaturas hai?

In [15]:
%sql SELECT count(*) as "Numero materias" from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(5,)]

In [16]:
# 8. Custo da materia máis cara.

In [17]:
%sql select max(custoBasico)as custoMaximo from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(Decimal('70.00'),)]

In [18]:
%sql select nome, custoBasico as custo from materia order by custoBasico desc limit 1

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[('Química Física', Decimal('70.00'))]

In [19]:
# 9. Custo da asignatura máis barata.

In [20]:
%sql select min(custoBasico)as custoMinimo from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(Decimal('30.00'),)]

In [21]:
%sql select nome, custoBasico as custo from materia order by custoBasico asc limit 1

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[('Seguridad Vial', Decimal('30.00'))]

In [22]:
# 10. Custo máximo, mínimo e medio das materias.

In [23]:
%%sql select 
max(custoBasico) as máximo,
min(custoBasico) as mínimo,
avg(custoBasico) as medio
from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(Decimal('70.00'), Decimal('30.00'), Decimal('58.000000'))]

In [25]:
# 11. Cantas posibilidades de créditos de asignatura hai?

In [26]:
%sql select count(distinct(creditos)) as posibilidades from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(3,)]

In [28]:
# 12. Cantos cursos hai?

In [29]:
%sql select count(distinct(curso)) as num_cursos from materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(3,)]

In [34]:
%sql select count(distinct(curso)) as num_cursos from materia where curso <> ''

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(2,)]

In [ ]:
# 13. Cantas cidades e nomes distintos hai?

In [ ]:
# Precísanse dúas consultas

In [36]:
%sql select count(distinct(cidade)) as num_cidades from persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(5,)]

In [37]:
%sql select count(distinct(nome)) as num_nome from persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(9,)]

In [ ]:
# Ou unha soa

In [38]:
%sql select count(distinct(cidade)) as num_cidades, count(distinct(nome)) as num_nome from persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[(5, 9)]

In [39]:
# 14. Nome e créditos das asignaturas do primeiro cuatrimestre.

In [40]:
%sql select nome, creditos, cuadrimestre from materia where cuadrimestre = 1

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
3 rows affected.

[('Seguridad Vial', Decimal('4.50'), '1'),
 ('Programación I', Decimal('9.00'), '1'),
 ('Contabilidad', Decimal('6.00'), '1')]

In [41]:
# 15. Nome e custo básico das asignaturas de máis de 4,5 créditos.

In [42]:
%sql select nome, custoBasico from materia where creditos > 4.5

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
3 rows affected.

[('Programación I', Decimal('60.00')),
 ('Análisis II', Decimal('60.00')),
 ('Contabilidad', Decimal('70.00'))]

In [ ]:
# 16. Nome das materias cuxo custo está entre 25 e 50 euros. (Con e sen BETWEEN).

In [43]:
%sql select nome, custoBasico from materia where custoBasico > 25 and custoBasico < 50

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[('Seguridad Vial', Decimal('30.00'))]

In [44]:
%sql select nome, custoBasico from materia where custoBasico between 25 and 50

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
1 rows affected.

[('Seguridad Vial', Decimal('30.00'))]

In [ ]:
# 17. Mostrar o Id do alumnado matriculado na asignatura '150212' ou 
# ben na '130113', ou en ambas as dúas. (Con e sen IN).

In [50]:
%%sql
select
distinct idAlumno
FROM
alumno_materia
WHERE 
idMateria = 150212 or idMateria = 130113

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
3 rows affected.

[('A010101',), ('A020202',), ('A030303',)]

In [51]:
%%sql
select
distinct idAlumno
FROM
alumno_materia
WHERE 
idMateria IN (150212,130113)

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
3 rows affected.

[('A010101',), ('A020202',), ('A030303',)]

In [ ]:
# 18. Mostrar o Id do alumnado matriculado en calquera asignatura salvo a '150212' ou a '130113'.

In [56]:
# Esta é a solución intuitiva pero incorrecta
# Devolvería resultados de alumnos que están matriculados nestas materias pero tamén outras diferentes
%%sql
select
distinct idAlumno
FROM
alumno_materia
WHERE 
idMateria NOT IN (150212,130113)

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
4 rows affected.

[('A030303',), ('A040404',), ('A121212',), ('A131313',)]

In [ ]:
# 19.Nome das asignaturas do segundo cuatrimestre que non sexan de 6 créditos.

In [60]:
%%sql
SELECT 
nome, creditos
FROM
materia
WHERE
cuadrimestre = 2 and creditos != 6

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
2 rows affected.

[('Análisis II', Decimal('9.00')), ('Química Física', Decimal('4.50'))]

In [ ]:
# 20. Mostrar o nome das asignaturas cuxo custo por crédito sexa maior de 8 euros.

In [63]:
%%sql
SELECT 
nome, custoBasico/creditos
FROM
materia
WHERE
custoBasico/creditos > 8

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
2 rows affected.

[('Química Física', Decimal('15.555556')),
 ('Contabilidad', Decimal('11.666667'))]

In [ ]:
# 21. Nome e número de horas de todas as asignaturas (1crédito = 10h).

In [64]:
%%sql
SELECT 
nome, creditos*10 horas
FROM
materia

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
5 rows affected.

[('Seguridad Vial', Decimal('45.00')),
 ('Programación I', Decimal('90.00')),
 ('Análisis II', Decimal('90.00')),
 ('Química Física', Decimal('45.00')),
 ('Contabilidad', Decimal('60.00'))]

In [ ]:
# 22. Mostrar o nome e o apelido das persoas cuxo apelido comece pola letra 'G'.

In [3]:
%%sql
SELECT 
nome, apelido
FROM
persoa
WHERE
apelido like 'G%'

 * mysql+pymysql://user:***@10.133.27.76:3306/universidade
3 rows affected.

[('Rosa', 'García'), ('María', 'Gutiérrez'), ('Elena', 'González')]

In [ ]:
# 23. Datos das persoas que haceron en 1978.

In [4]:
%%sql
SELECT 
*
FROM
persoa
WHERE
year(dataNacemento) = 1978

 * mysql+pymysql://user:***@10.133.27.76:3306/universidade
1 rows affected.

[('23232323A', 'Jorge', 'Sáenz', 'Logroño', 'Luis Ulloa', '17', '941171717', datetime.date(1978, 9, 9), '1')]

In [ ]:
# 24. Mostrar o nome das persoas para as que se descoñece a data de nacemento.

In [5]:
%%sql
SELECT 
*
FROM
persoa
WHERE
dataNacemento IS NULL

 * mysql+pymysql://user:***@10.133.27.76:3306/universidade
2 rows affected.

[('16161616A', 'Luis', 'Ramírez', 'Haro', 'Pez', '34', '941111111', None, '1'),
 ('21212121A', 'Rosa', 'García', 'Haro', 'Alegría', '16', '941161616', None, '0')]

In [6]:
# 25. Mostrar as materias que non pertencen a ningunha titulación.

In [7]:
%%sql
SELECT 
*
FROM
materia

 * mysql+pymysql://user:***@10.133.27.76:3306/universidade
5 rows affected.

[('115', 'Seguridad Vial', Decimal('4.50'), '1', Decimal('30.00'), 'P204', '', ''),
 ('130113', 'Programación I', Decimal('9.00'), '1', Decimal('60.00'), 'P101', '130110', '1'),
 ('130122', 'Análisis II', Decimal('9.00'), '2', Decimal('60.00'), 'P203', '130110', '2'),
 ('150212', 'Química Física', Decimal('4.50'), '2', Decimal('70.00'), 'P304', '150210', '1'),
 ('160002', 'Contabilidad', Decimal('6.00'), '1', Decimal('70.00'), 'P117', '160000', '1')]

In [73]:
# Controlamos valores NULL
%%sql
SELECT 
*
FROM
materia
WHERE
idTitulacion IS NULL

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
0 rows affected.

[]

In [8]:
# Controlamos valores de texto baleiros
%%sql
SELECT 
*
FROM
materia
WHERE
idTitulacion IS NULL OR idTitulacion = ''

 * mysql+pymysql://user:***@10.133.27.76:3306/universidade
1 rows affected.

[('115', 'Seguridad Vial', Decimal('4.50'), '1', Decimal('30.00'), 'P204', '', '')]

In [ ]:
# 26. Listaxe do nome completo das persoas, os seus teléfonos e os seus enderezos,
# chamando á columna do nome 'NomeCompleto' e á de enderezos 'Enderezo'

In [81]:
%%sql
SELECT 
*
concat(nome,' ', apelido) NomeCompleto, telefono, concat('Rua ',enderezoRua,', ',enderezoNum,', ',cidade) Enderezo
FROM
persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[('Luis Ramírez', '941111111', 'Rua Pez, 34, Haro'),
 ('Laura Beltrán', '912121212', 'Rua Gran Vía, 23, Madrid'),
 ('Pepe Pérez', '913131313', 'Rua Percebe, 13, Madrid'),
 ('Juan Sánchez', '944141414', 'Rua Melancolía, 7, Bilbao'),
 ('Luis Jiménez', '941151515', 'Rua Cigüeña, 15, Nájera'),
 ('Rosa García', '941161616', 'Rua Alegría, 16, Haro'),
 ('Jorge Sáenz', '941171717', 'Rua Luis Ulloa, 17, Logroño'),
 ('María Gutiérrez', '941181818', 'Rua Avda. de la Paz, 18, Logroño'),
 ('Rosario Díaz', '941191919', 'Rua Percebe, 19, Logroño'),
 ('Elena González', '941202020', 'Rua Percebe, 20, Logroño')]

In [ ]:
# 27. Cal é o día seguinte ao día no que naceu cada persoa?

In [86]:
%%sql
SELECT 
dataNacemento
FROM
persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[(datetime.date(2069, 1, 1),),
 (datetime.date(1974, 8, 8),),
 (datetime.date(1980, 2, 2),),
 (datetime.date(2066, 3, 3),),
 (datetime.date(1979, 3, 3),),
 (datetime.date(1978, 4, 4),),
 (datetime.date(1978, 9, 9),),
 (datetime.date(2064, 10, 10),),
 (datetime.date(1971, 11, 11),),
 (datetime.date(1975, 5, 5),)]

In [95]:
%%sql
SELECT 
dataNacemento, dataNacemento + interval 1 day diaSeguinte
FROM
persoa
#https://mariadb.com/kb/en/date_add/

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[(datetime.date(2069, 1, 1), datetime.date(2069, 1, 2)),
 (datetime.date(1974, 8, 8), datetime.date(1974, 8, 9)),
 (datetime.date(1980, 2, 2), datetime.date(1980, 2, 3)),
 (datetime.date(2066, 3, 3), datetime.date(2066, 3, 4)),
 (datetime.date(1979, 3, 3), datetime.date(1979, 3, 4)),
 (datetime.date(1978, 4, 4), datetime.date(1978, 4, 5)),
 (datetime.date(1978, 9, 9), datetime.date(1978, 9, 10)),
 (datetime.date(2064, 10, 10), datetime.date(2064, 10, 11)),
 (datetime.date(1971, 11, 11), datetime.date(1971, 11, 12)),
 (datetime.date(1975, 5, 5), datetime.date(1975, 5, 6))]

In [ ]:
# 28. Anos das persoas na base de datos.

In [98]:
%%sql
SELECT 
year(now())- year(dataNacemento) Anos
FROM
persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[(-45,), (50,), (44,), (-42,), (45,), (46,), (46,), (-40,), (53,), (49,)]

In [104]:
%%sql
SELECT 
DATEDIFF(now(), dataNacemento)/365 as Anos
FROM
persoa

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[(Decimal('-44.9945'),),
 (Decimal('49.4712'),),
 (Decimal('43.9808'),),
 (Decimal('-42.1589'),),
 (Decimal('44.9014'),),
 (Decimal('45.8137'),),
 (Decimal('45.3808'),),
 (Decimal('-40.7644'),),
 (Decimal('52.2137'),),
 (Decimal('48.7315'),)]

In [ ]:
# 29. Listaxe de persoas ordenadas por apelidos e nome.

In [106]:
%%sql
SELECT 
apelido, nome
FROM
persoa
ORDER BY 
apelido, nome
ASC

 * mysql+pymysql://user:***@10.133.27.105:3306/universidade
10 rows affected.

[('Beltrán', 'Laura'),
 ('Díaz', 'Rosario'),
 ('García', 'Rosa'),
 ('González', 'Elena'),
 ('Gutiérrez', 'María'),
 ('Jiménez', 'Luis'),
 ('Pérez', 'Pepe'),
 ('Ramírez', 'Luis'),
 ('Sáenz', 'Jorge'),
 ('Sánchez', 'Juan')]

In [ ]:
# 30. Listaxe de persoas maiores de 25 anos ordenadas por apelidos e nome.

In [12]:
%%sql
SELECT 
apelido, nome, dataNacemento, TRUNCATE(DATEDIFF(now(), dataNacemento)/365,0) as Anos
FROM
persoa
WHERE
dataNacemento < now() - interval 25 year
ORDER BY 
apelido, nome
ASC

 * mysql+pymysql://user:***@10.133.27.76:3306/universidade
8 rows affected.

[('Beltrán', 'Laura', datetime.date(1974, 8, 8), Decimal('49')),
 ('Díaz', 'Rosario', datetime.date(1971, 11, 11), Decimal('52')),
 ('González', 'Elena', datetime.date(1975, 5, 5), Decimal('48')),
 ('Gutiérrez', 'María', datetime.date(1964, 10, 10), Decimal('59')),
 ('Jiménez', 'Luis', datetime.date(1979, 3, 3), Decimal('44')),
 ('Pérez', 'Pepe', datetime.date(1980, 2, 2), Decimal('43')),
 ('Sáenz', 'Jorge', datetime.date(1978, 9, 9), Decimal('45')),
 ('Sánchez', 'Juan', datetime.date(1966, 3, 3), Decimal('57'))]

In [ ]:
# 31. Listaxe que mostre as asignaturas co seu custo por crédito ordenadas polo seu custo por crédito.

In [ ]:
# 32. Listaxe de nomes completos de todos os alumnos.

In [ ]:
# 33. Listaxe de alumnado matriculado que vive en 'La Rioja'.

In [ ]:
# 34. Listaxe de asignaturas impartidas por profesores de Logroño.

In [ ]:
# 35. Listaxe de profesores que ademais son alumnos.

In [ ]:
# 36. Nomes completos dos profesores que ademais son alumnos.

In [ ]:
# 37. Nomes completos do alumnado que cursa a materia de 'Seguridad Vial'.

In [ ]:
# 38. Nomes completos do alumnado que cursa algunha asignatura do 2º cuatrimestre.

In [ ]:
# 39. Nomes do profesorado que imparte polo menos unha asignatura.

In [ ]:
# 40. Suma dos créditos das asignaturas de Matemáticas.

In [ ]:
# 41. Número de asignaturas da titulación de Matemáticas.

In [ ]:
# 42. Id das titulacións nas que está matriculado o alumno co DNI '18181818A'
# sabendo que para que un alumno esté matriculado nunha titulación basta con que 
# esté matriculado nalgunha das súas asignaturas.

In [ ]:
# 43. Cal sería o custo global de cursar a titulación de Matemáticas se o custo de cada asignatura
# fora incrementado un 7%.

In [ ]:
# 44. Profesorado que tamén é alumno indicando a asignatura ou asignaturas que cursan.

In [ ]:
# 45. Titulacións (nomes) nas que imparte docencia cada profesor, xunto co nome de cada profesor.

In [ ]:
# 46. Listaxe ordenado por nome de titulación e nome da asignatura de todas as asignaturas,
# mostrando ademais a titulación, nome da asignatura e nome do profesor.

In [ ]:
# 47. Nomes completos de alumnos matriculados en algunha asignatura mostrando cal é a asignatura e
# a titulación á que pertencen as asignaturas.

In [ ]:
# 48. Listaxe que mostre, por cada asignatura, os nomes completos dos alumnos matriculados.

In [ ]:
# 48B. Supoñendo que se ten a seguinte táboa, que clasifica os tamamos das asignaturas en función
# do seu número de créditos.
# Nome da táboa: TamanhoAsignatura

# Tamanho | CreditosMin | CreditosMax
# Corta   | 0           | 4.5
# Media   | 6           | 7.5
# Larga   | 9           | 100

# Obtén un listado das asignaturas xunto coa calificación da súa duración segunto a táboa anterior.

In [ ]:
# 49. Asignaturas da titulación de Matemáticas.

In [ ]:
# 50. Listaxe de asignaturas que teñan máis créditos que 'Seguridad Vial'